OpenFoam_Cases/Channel_14124_M2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       47680;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       47800;
    }
    sides1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12000;
        startFace       47920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half1;
    }
    sides1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12000;
        startFace       59920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half0;
    }
    sides2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12000;
        startFace       71920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half1;
    }
    sides2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12000;
        startFace       83920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half0;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       95920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half1;
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       96020;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half0;
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       96120;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half1;
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       96220;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half0;
    }
)

// ************************************************************************* //
